const a = ['一样', '细小', '吓人', '大量', '可怕', '清白', '朝阳', '现成', '可怜', '次要', '大气', '不定', '可心', '发火', '天生', '详细', '知足', '刻苦', '刚好', '和气', '黄色', '正好', '永久', '用功', '知己', '草本', '老大', '冷清', '不合', '友爱', '非分',' 高',' 花',' 海', '相对', '冷冰冰', '透明', '安定', '安乐', '安全', '安心', '动人', '多余', '暗淡', '平和', '平静', '齐全', '奇妙', '热情', '热心', '听话', '出名', '平安', '平常', '平淡', '大方', '得力', '低级', '纯净', '白净', '晴朗', '暖和', '亲爱', '怕人', '齐全', '奇妙', '光亮', '光明', '广大', '冰冷', '共同', '细心', '相同', '空洞', '空旷', '后来', '快活', '洪亮', '喜欢', '鲜红', '鲜艳', '辛苦', '刚好', '用功', '知足', '友爱', '可怜', '刻苦', '拥挤', '友好', '有力', '无知', '用心', '礼貌', '理想', '凉快', '老实', '乐观', '冷淡', '秀丽']

const b = ['兔子', '老虎', '犀牛', '蟒蛇', '海豹', '孔雀', '鳄鱼', '猴子', '棕熊', '豺狼', '石榴', '香蕉', '苹果', '梨子', '草莓', '芒果', '葡萄', '蜜桃', '荔枝', '西瓜', '海报', '墙壁', '围墙', '汽车', '卡车', '单车', '单词', '鼠标', '书包', '书本', '象棋', '香气', '围棋', '跳棋', '军旗', '军区', '蘑菇', '木耳', '母鸡', '木屐', '钱包', '铅笔', '前辈', '相片', '橡皮', '格尺', '彩旗', '古筝', '小孩', '小号', '笑话', '校花', '小花', '草原', '草鱼', '鲈鱼', '梭鱼', '琵琶', '竖琴', '扬琴', '芹菜', '黄瓜', '皇冠', '皇宫', '黄山', '皇上', '香水', '面膜', '面貌', '面目', '唇膏', '作业', '座椅', '数字', '树枝', '树脂', '书桌', '椅子', '板凳', '岛屿', '刀鱼', '导师', '道士', '和尚', '水流', '花朵', '树木', '荷花', '莲花', '荷塘', '合同', '核桃', '木鱼', '钱包', '铅笔', '前辈', '狮子', '时装', '市长', '师长']

const temp = []
function randomName () {
  let al = a.length,
      bl = b.length,
      ra = Math.floor(Math.random() * al),
      rb = Math.floor(Math.random() * bl),
      res = `${a[ra]}的${b[rb]}`;

  if (temp.length && temp.includes(res)) {
    return randomName()
  } else {
    temp.push(res)
    return `${a[ra]}的${b[rb]}`
  }
}

module.exports = {
  randomName
}
